peterzhenghj/circuitpython/ports/espressif/boards/waveshare_esp32_c6_zero/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2019 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

// Micropython setup

#define MICROPY_HW_BOARD_NAME       "Waveshare ESP32-C6-Zero"
#define MICROPY_HW_MCU_NAME         "ESP32C6"

#define MICROPY_HW_NEOPIXEL         (&pin_GPIO8)
#define MICROPY_HW_NEOPIXEL_COUNT   (1)

#define DEFAULT_I2C_BUS_SCL         (&pin_GPI15)
#define DEFAULT_I2C_BUS_SDA         (&pin_GPI14)

#define DEFAULT_SPI_BUS_SCK         (&pin_GPIO19)
#define DEFAULT_SPI_BUS_MOSI        (&pin_GPIO21)
#define DEFAULT_SPI_BUS_MISO        (&pin_GPIO20)

#define DEFAULT_UART_BUS_RX         (&pin_GPIO17)
#define DEFAULT_UART_BUS_TX         (&pin_GPIO16)
